Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/**
* @brief API service ID for Adc_EnableCtuControlMode function
* */
#define ADC_ENABLE_CTU_CONTROL_MODE_ID               (0x32U)
/**
* @brief API service ID for Adc_DisableCtuControlMode function
* */
#define ADC_DISABLE_CTU_CONTROL_MODE_ID              (0x33U)

#define ADC_CTU_ENABLE_HW_TRIGGER_ID                 (0x34U)
#define ADC_CTU_DISABLE_HW_TRIGGER_ID                (0x35U)
#define ADC_CTU_START_CONVERSION_ID                  (0x36U)
#define ADC_CTU_READ_CONV_DATA_ID                    (0x37U)
#define ADC_CTU_READ_CONV_RESULT_ID                  (0x38U)
#define ADC_CTU_READ_FIFO_DATA_ID                    (0x39U)
#define ADC_CTU_READ_FIFO_RESULT_ID                  (0x3AU)
#define ADC_CTU_SET_FIFO_WATERMARK_ID                (0x3BU)
#define ADC_CTU_ENABLE_NOTIFICATION_ID               (0x3CU)
#define ADC_CTU_DISABLE_NOTIFICATION_ID              (0x3DU)
#define ADC_CTU_SET_LIST_POINTER_ID                  (0x3EU)
#define ADC_CTU_SET_LIST_ID                          (0x3FU)
#define ADC_CTU_STOP_LOOP_CONVERSION_ID              (0x40U)
#define ADC_CTU_MASTER_RELOAD_ID                     (0x41U)
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

#if (ADC_ENABLE_READ_RAW_DATA_API == STD_ON)
#define ADC_ENABLE_READ_RAW_DATA_ID                  (0x42U)
#endif /* (ADC_ENABLE_READ_RAW_DATA_API == STD_ON) */

#ifdef ADC_WDG_SUPPORTED
#define ADC_ENABLEWDGNOTIFICATION_ID                 (0x43U)
#define ADC_DISABLEWDGNOTIFICATION_ID                (0x44U)
#endif /* ADC_WDG_SUPPORTED */

#if (ADC_ENABLE_TEMPSENSE_API == STD_ON)
#define ADC_TEMPSENSE_CALCULATE_TEMP_ID              (0x4AU)
#define ADC_TEMPSENSE_GET_TEMP_ID                    (0x4BU)
#endif /* (ADC_ENABLE_TEMPSENSE_API == STD_ON) */

#if (ADC_APPLY_CALIBRATION == STD_ON)
/**
* @brief API service ID for Adc_ApplyCalibration function
* */
#define ADC_APPLY_CALIBRATION_ID                     (0x4CU)
#endif /* (ADC_APPLY_CALIBRATION == STD_ON) */


/*==================================================================================================
*                                             ENUMS
==================================================================================================*/

/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/
#define ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
#include "Adc_MemMap.h"
/**
* @brief          Used to point the configuration structure.
*/
extern const Adc_ConfigType * Adc_apxCfgPtr[ADC_MAX_PARTITIONS];
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
/**
* @brief          Clock mode in use
*/
extern Adc_SelectPrescalerType Adc_aeClockMode[ADC_MAX_PARTITIONS];
#endif /*if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)*/
#endif /*if (ADC_DUAL_CLOCK_MODE == STD_ON)*/

extern Adc_GroupStatusType Adc_axGroupStatus[ADC_MAX_GROUPS];
extern Adc_UnitStatusType Adc_axUnitStatus[ADC_IPW_MAX_HW_UNITS];
#if (ADC_SETCHANNEL_API == STD_ON)
extern Adc_RuntimeGroupChannelType Adc_axRuntimeGroupChannel[ADC_MAX_GROUPS];
#endif /*(ADC_SETCHANNEL_API == STD_ON)*/
#define ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
#include "Adc_MemMap.h"

#if (ADC_PRECOMPILE_SUPPORT == STD_ON)
    #define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #include "Adc_MemMap.h"
    extern const Adc_ConfigType * const Adc_ConfigVariantPredefined[ADC_MAX_PARTITIONS];
    #define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    #include "Adc_MemMap.h"
#else
    #define ADC_START_SEC_CONST_UNSPECIFIED
    #include "Adc_MemMap.h"

    ADC_CONFIG_EXT

    #define ADC_STOP_SEC_CONST_UNSPECIFIED
    #include "Adc_MemMap.h"
#endif /* (ADC_PRECOMPILE_SUPPORT == STD_ON) */

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

/**
* @brief          Initializes the ADC hardware unit and the driver.
* @details        This function will initialize both the ADC HW unit and the driver structures.
*
* @param[in]      ConfigPtr   Pointer to configuration set in Variant PB
*                             (Variant PC requires a NULL_PTR).
* @return         void
*
* @implements  Adc_Init_Activity
*/
void Adc_Init(const Adc_ConfigType * ConfigPtr);

/**
* @brief          Initializes the group specific ADC result buffer pointer as
*                 configured to point to the pDataBufferPtr address which is
*                 passed as parameter.
* @details        Initializes ADC driver with the group specific result buffer
*                 start address where the conversion results will be stored.
*                 The application has to ensure that the application buffer,
*                 where pDataBufferPtr points to, can hold all the conversion
*                 results of the specified group. The initialization with
*                 Adc_SetupResultBuffer is required after reset, before a group
*                 conversion can be started.
*
* @param[in]      Group           Numeric ID of requested ADC channel group.
* @param[in]      pDataBufferPtr   Pointer to result data buffer
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Result buffer pointer initialized correctly.
*                 E_NOT_OK:       Operation failed or development error
*                                 occurred.
*
* @implements  Adc_SetupResultBuffer_Activity
*/
Std_ReturnType Adc_SetupResultBuffer(Adc_GroupType Group,
                                     Adc_ValueGroupType * const DataBufferPtr);

#if (ADC_DEINIT_API == STD_ON)
/**
* @brief          Returns all ADC HW Units to a state comparable to their
*                 power on reset state.
* @details        Returns all ADC HW Units to a state comparable to their
*                 power on reset state, and de-initialize the ADC driver.
*
* @return         void
*
* @implements  Adc_DeInit_Activity
*/
void Adc_DeInit(void);
#endif /* ADC_DEINIT_API == STD_ON */

