Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
* @brief          Starts the conversion of all channels of
*                 the requested ADC Channel group.
* @details        This function will start the SW conversion of all channels
*                 of the requested ADC channel group.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_StartGroupConversion_Activity
*/
void Adc_StartGroupConversion(Adc_GroupType Group);

/**
* @brief          Stops the conversion of all channels of the requested ADC
*                 Channel group.
* @details        This function will stop the SW conversion of all channels
*                 of the requested ADC channel group.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_StopGroupConversion_Activity
*/
void Adc_StopGroupConversion(Adc_GroupType Group);

#endif /* ADC_ENABLE_START_STOP_GROUP_API == STD_ON */

#if (ADC_READ_GROUP_API == STD_ON)
/**
* @brief          Reads the group conversion results.
* @details        Reads the group conversion results of the last completed
*                 conversion round of the requested group and stores the
*                 channel values starting at the pDataBufferPtr address.
*                 The group channel values are stored in ascending channel
*                 number order (in contrast to the storage layout of the
*                 result buffer if streaming access is configured).
*
* @param[in]      Group          Numeric ID of requested ADC Channel group.
* @param[in]      pDataBufferPtr  ADC results of all channels of the selected group
*                                are stored in the data buffer addressed with the pointer.
* @return         Std_ReturnType Standard return type.
*                 E_OK:          results are available and written to the
*                                data buffer.
*                 E_NOT_OK:      no results are available or development
*                                error occurred.
*
* @implements  Adc_ReadGroup_Activity
*/
Std_ReturnType Adc_ReadGroup(Adc_GroupType Group,
                             Adc_ValueGroupType * DataBufferPtr);

#endif /* ADC_READ_GROUP_API == STD_ON */

#if (ADC_ENABLE_READ_RAW_DATA_API == STD_ON)
/**
* @brief        Read the raw result data from an ADC unit.
* @details      Read the raw result data from an ADC unit.
*               Intended for reading ADC results directly from ADC registers
*               and can eliminate surplus interrupts if there are more triggered
*               measurements than FIFO length.
*               Measured values remain in ADC result registers(user must ensure
*               that they are not overwritten).
*
* @param[in]    Unit           Adc unit used. Recommended to use generated define for Adc Logical Unit Id.
* @param[in]    ChansArray     List of channels for which results to be read
* @param[in]    NumItems       Number of results to read
* @param[out]   DataBufferPtr  Destination pointer in which the results will be written
*
* @return         void
*
* @implements  Adc_ReadRawData_Activity
*/
void Adc_ReadRawData(Adc_HwUnitType Unit,
                     const Adc_ChannelType * const ChansArray,
                     uint8 NumItems,
                     Adc_ValueGroupType * const DataBufferPtr);

#endif /* (ADC_ENABLE_READ_RAW_DATA_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          Enables the hardware trigger for the requested ADC Channel group.
* @details        This function will enable the HW trigger source for the requested
*                 ADC channel group. This function does set the CTU register for all
*                 platform that have the CTU Hw Unit.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_EnableHardwareTrigger_Activity
*/
void Adc_EnableHardwareTrigger(Adc_GroupType Group);

/**
* @brief          Disables the hardware trigger for the requested ADC Channel group.
* @details        This function will disable the HW trigger source for the requested
*                 ADC channel group.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_DisableHardwareTrigger_Activity
*/
void Adc_DisableHardwareTrigger(Adc_GroupType Group);

#endif /* ADC_HW_TRIGGER_API == STD_ON */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
/**
* @brief          Enables the notification mechanism for the requested ADC
*                 channel group.
* @details        This function will enable the notification mechanism only for
*                 the requested ADC channel group.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_EnableGroupNotification_Activity
*/
void Adc_EnableGroupNotification(Adc_GroupType Group);

/**
* @brief          Disables the notification mechanism for the requested ADC
*                 channel group.
* @details        This function will disable the notification mechanism only for
*                 the requested ADC channel group.
*
* @param[in]      Group       Numeric ID of requested ADC channel group.
* @return         void
*
* @implements  Adc_DisableGroupNotification_Activity
*/
void Adc_DisableGroupNotification(Adc_GroupType Group);

#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

/**
* @brief          Returns the conversion status of the requested ADC Channel group.
* @details        This function will return the conversion status of the requested
*                 ADC channel group.
*
* @param[in]      Group             Numeric ID of requested ADC channel group.
* @return         Adc_StatusType    Conversion status for the requested group.
*                 ADC_IDLE          in case of errors.
*                 conversion status in case of no errors.
*
* @implements  Adc_GetGroupStatus_Activity
*/
Adc_StatusType Adc_GetGroupStatus(Adc_GroupType Group);

/**
* @brief          Returns the number of valid samples per channel.
* @details        Returns the number of valid samples per channel, stored in
*                 the result buffer. Reads a pointer, pointing to a position
*                 in the group result buffer. With the pointer position, the
*                 results of all group channels of the last completed conversion
*                 round can be accessed. With the pointer and the return value,
*                 all valid group conversion results can be accessed (the user
*                 has to take the layout of the result buffer into account).
*
* @param[in]      Group              Numeric ID of requested ADC channel group.
* @param[out]     PtrToSamplePtr     Pointer to result buffer pointer.
*
* @return         Adc_StreamNumSampleType Number of valid samples per channel.
*                 0                 in case of errors.
*                 >0                Number of valid samples per channel.
*
* @implements  Adc_GetStreamLastPointer_Activity
*/
Adc_StreamNumSampleType Adc_GetStreamLastPointer(Adc_GroupType Group,
                                                 Adc_ValueGroupType ** PtrToSamplePtr);

#if (ADC_VERSION_INFO_API == STD_ON)
/**
* @brief          Returns the version information of this module.
* @details        Returns the version information of this module.
*
* @param[out]     pVersionInfo    Pointer to where to store the version
*                                 information of this module.
*                 structure       in case of no errors.
*
* @implements  Adc_GetVersionInfo_Activity
*/
void Adc_GetVersionInfo(Std_VersionInfoType * versioninfo);

#endif /* ADC_VERSION_INFO_API == STD_ON */

#if (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON)
/**
* @brief          Set the ADC mode either to powerdown or normal.
* @details        Set the ADC either to powerdown or normal mode.
*
* @param[in]      Unit            Adc unit used. Recommended to use generated define for Adc Logical Unit Id
* @param[in]      SetPowerMode    Power mode to set: normal or powerdown.
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Transition successful.
*                 E_NOT_OK:       Transition unsuccessful.
*
* @implements  Adc_SetHwUnitPowerMode_Activity
*/
Std_ReturnType Adc_SetHwUnitPowerMode(Adc_HwUnitType Unit,
                                      Adc_SetPowerModeType SetPowerMode);

