Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
/**
* @brief   Function to set BCTU/CTU power mode.
*
* @details Set BCTU/CTU power mode.
*
* @param[in] CtuUnit   Bctu/Ctu hardware unit. Recommended to use generated define for Bctu/Ctu Logical Unit Id.
* @param[in] State     Power state to be set
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Transition successful.
*                 E_NOT_OK:       Transition unsuccessful.
*
* @implements  Adc_CtuSetPowerMode_Activity
*/
Std_ReturnType Adc_CtuSetPowerMode(Adc_HwUnitType CtuUnit,
                                   Adc_PowerStateType State);

#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
#endif /* (ADC_SET_HW_UNIT_POWER_MODE_API == STD_ON) */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
/**
* @brief          Enable the TriggerSource for group selected by Group parameter.
* @details        This Autosar Extension API is used to enable any one of the configured
*                 TriggerSource of the Group. When this Autosar Extension API is used to
*                 enable the trigger source the CTU interrupt will be disabled by the driver.
*                 So user has to call the Autosar Extension API Adc_HwResultReadGroup to read
*                 the converted result from the ADC hardware register.
*
* @param[in]      Group            Index of group.
* @param[in]      TriggerSource    Trigger source to be used for the group.
*                                  (Configuration file should contain it for that group).
* @return         void
*
* @implements  Adc_EnableCTUTrigger_Activity
*/
void Adc_EnableCTUTrigger(Adc_GroupType Group,
                          Adc_HwTriggerTimerType TriggerSource);

/**
* @brief          Disable the TriggerSource for group selected by Group parameter.
* @details        This Autosar Extension API is used to disable the already enabled
*                 TriggerSource of the Group.
*
* @param[in]      Group            Index of group.
* @param[in]      TriggerSource    Trigger source to be disabled for the group.
*                                  (Configuration file should contain it for that group).
* @return         void
*
* @implements  Adc_DisableCTUTrigger_Activity
*/
void Adc_DisableCTUTrigger(Adc_GroupType Group,
                           Adc_HwTriggerTimerType TriggerSource);

/**
* @brief          Read the result of the hardware triggered groups conversion result.
* @details        This Autosar Extension API is used to read the result of the hardware
*                 triggered groups conversion result from the ADC hardware register
*                 in this case the CTU interrupt will be disabled for the group.
*                 The VALID bit CDR register will be cleared automatically when we read the results
*                 from the channel data register. If the user calls Autosar Extension function
*                 Adc_HwResultReadGroup() once again before the next conversion takes place, the
*                 Adc_HwResultReadGroup() returns E_NOT_OK.
*
* @param[in]      Group      Index of group.
* @param[in]      DataPtr    Pointer to a buffer which will be filled by the
*                            conversion results.
* @return         Std_ReturnType Standard return type.
*                 E_OK:          results are available and written to the
*                                data buffer.
*                 E_NOT_OK:      no results are available or development
*                                error occurred.
*
* @implements  Adc_HwResultReadGroup_Activity
*/
Std_ReturnType Adc_HwResultReadGroup(Adc_GroupType Group,
                                     Adc_ValueGroupType * DataPtr);

#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
 * @brief   Enable an individual channel configured in SW-triggered (non-injected) ADC Group at initialization
 * @details Enable an individual channel configured in SW-triggered (non-injected) ADC Group at initialization
 *          Use generated symbolic channel name defines (e.g. AdcChannel_0_0), because function assumes ChannelId to be in following format:
 *          Logical channel id on bits until position defined by ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16, and for the rest the Logical Unit Id
 *          The driver will not update the values in result buffers corresponding to disabled channels, keeping in the buffer the last results from when the channel was enabled.
 *
 * @param[in]  Adc_GroupType                Group logical ID or group symbolic name
 * @param[in]  Adc_ChannelType              Symbolic name of channel
 *
 * @return         void.
 *
 * @implements      Adc_EnableChannel_Activity
 */
void Adc_EnableChannel(Adc_GroupType Group,
                       Adc_ChannelType Channel);

/**
 * @brief   Disable an individual channel configured in SW-triggered (non-injected) ADC Group at initialization
 * @details Disable an individual channel configured in SW-triggered (non-injected) ADC Group at initialization
 *          Use generated symbolic channel name defines (e.g. AdcChannel_0_0), because function assumes ChannelId to be in following format:
 *          Logical channel id on bits until position defined by ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16, and for the rest the Logical Unit Id
 *          The driver will not update the values in result buffers corresponding to disabled channels, keeping in the buffer the last results from when the channel was enabled.
 *
 * @param[in]  Adc_GroupType                Group logical ID or group symbolic name
 * @param[in]  Adc_ChannelType              Symbolic name of channel
 *
 * @return         void.
 *
 * @implements      Adc_DisableChannel_Activity
 */
void Adc_DisableChannel(Adc_GroupType Group,
                        Adc_ChannelType Channel);

#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON)
/**
* @brief          Get the injected conversions status.
* @details        This function checks if an injected conversion (HW,SW) is ongoing
*
* @param[in]      Unit            Adc unit used. Recommended to use generated define for Adc Logical Unit Id
*
* @return         Adc_StatusType  Status of the ADC HW unit.
*                 ADC_IDLE:       SW,HW Injection or Hardware Trigger group are idle.
*                 ADC_BUSY:       SW,HW Injection or Hardware Trigger is in progress.
*
* @implements  Adc_GetInjectedConversionStatus_Activity
*/
Adc_StatusType Adc_GetInjectedConversionStatus(Adc_HwUnitType Unit);

#endif /* ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON */

#if (ADC_CALIBRATION == STD_ON)
/**
* @brief          Executes high accuracy calibration of a ADC HW unit.
* @details        This function calibrates the ADC HW unit and updates calibration related registers
*
* @param[in]      Unit      Adc unit used. Recommended to use generated define for Adc Logical Unit Id
* @param[in]      pStatus   Status of the ADC HW unit calibration and
*                           list of failed and passed tests.
*
* @return         void
*
* @implements  Adc_Calibrate_Activity
*/
void Adc_Calibrate(Adc_HwUnitType Unit,
                   Adc_CalibrationStatusType * pStatus);

#endif /* (ADC_CALIBRATION == STD_ON) */

