Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#if (ADC_APPLY_CALIBRATION == STD_ON)
/**
* @brief          Calibrate the converted data of the SDADC.
* @details        This function applies calibration to the uncalibrated converted data acquired by DMA or Sdadc_Ip_GetRawConvDataFifo function.
*                 In the case uncalibrated converted data acquired by DMA, this function should be called in the DMA callback.
*                 NOTE: this function is only used for SDADC hardware units.
*
* @param[in]      Unit                Adc unit used. Recommended to use generated define for Adc Logical Unit Id.
* @param[in]      BufferLength        The number of entries in the uncalibrated data buffer.
* @param[in]      UncalibratedBuffer  The pointer to the converted data array which contains uncalibrated data.
* @param[out]     CalibratedBuffer    The pointer to the data array where the calibrated data will be stored.
*
* @return         Std_ReturnType.     Status of the apply calibration result.
*                 E_OK:               Calibration applied successfully.
*                 E_NOT_OK:           Invalid parameter given.
*
* @implements  Adc_ApplyCalibration_Activity
*/
Std_ReturnType Adc_ApplyCalibration(Adc_HwUnitType Unit,
                                    const uint32 BufferLength,
                                    const sint16 * const UncalibratedBuffer,
                                    sint16 * const CalibratedBuffer);

#endif /* (ADC_APPLY_CALIBRATION == STD_ON) */

#if (ADC_SELF_TEST == STD_ON)
/**
* @brief          Executes hardware Self Test of a ADC HW unit.
* @details        This function checks if the ADC HW unit is functioning correctly
*
* @param[in]      Unit      Adc unit used. Recommended to use generated define for Adc Logical Unit Id
*
* @return         Std_ReturnType. Status of the ADC HW unit Self Test.
*
* @implements  Adc_SelfTest_Activity
*/
Std_ReturnType Adc_SelfTest(Adc_HwUnitType Unit);

#endif /* (ADC_SELF_TEST == STD_ON) */

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
/**
* @brief      Function to reconfigure High and Low thresholds for a given threshold control index.
* @details    This function is used to reconfigure High and Low thresholds for a given threshold control index.
*             Use generated symbolic name defines of threshold register (e.g. AdcThresholdControl_0_0), because function assumes ThresholdControlIndex to be in following format:
*             Logical threshold id on bits until position defined by ADC_THRESHOLD_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16, and for the rest the Logical Unit Id
*
* @param[in]  ThresholdControlIndex       Symbolic name of threshold control
* @param[in]  LowValue                    Low threshold value of the threshold control
* @param[in]  HighValue                   High threshold value of the threshold control
*
* @return     void
*
* @implements      Adc_ConfigureThreshold_Activity
*/
void Adc_ConfigureThreshold(Adc_ThresholdControlIndexType ThresholdControlIndex,
                            Adc_WdgThresholdValueType LowValue,
                            Adc_WdgThresholdValueType HighValue);

#endif /*  ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON */

#ifdef ADC_WDG_SUPPORTED
/**
 * @brief   Enable notification of a channel that has watchdog functionality configured at initialization
 * @details Enable notification of a channel that has watchdog functionality configured at initialization
 *          Use generated symbolic channel name defines (e.g. AdcChannel_0_0), because function assumes ChannelId to be in following format:
 *          Logical channel id on bits until position defined by ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16, and for the rest the Logical Unit Id
 *
 * @param[in]  Adc_ChannelType              Symbolic name of channel
 *
 * @return         void.
 *
 * @implements      Adc_EnableWdgNotification_Activity
 */
void Adc_EnableWdgNotification(Adc_ChannelType ChannelId);

/**
 * @brief   Disable notification of a channel that has watchdog functionality configured at initialization
 * @details Disable notification of a channel that has watchdog functionality configured at initialization
 *          Use generated symbolic channel name defines (e.g. AdcChannel_0_0), because function assumes ChannelId to be in following format:
 *          Logical channel id on bits until position defined by ADC_CHANNEL_SYMBOLIC_NAME_SHIFT_HW_UNIT_ID_U16, and for the rest the Logical Unit Id
 *
 * @param[in]  Adc_ChannelType              Symbolic name of channel
 *
 * @return         void.
 *
 * @implements      Adc_DisableWdgNotification_Activity
 */
void Adc_DisableWdgNotification(Adc_ChannelType ChannelId);

#endif /* ADC_WDG_SUPPORTED */

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/**
* @brief          Set the ADC clock prescaler if available and modify the conversion timings.
* @details        This function sets the ADC clock prescaler (Analog clock frequency selector)
*
* @param[in]      Prescaler      Normal or Alternate mode.
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           In case of successful settings.
*                 E_NOT_OK:       In case of unsuccessful settings.
*
* @implements  Adc_SetClockMode_Activity
*/
Std_ReturnType Adc_SetClockMode(Adc_SelectPrescalerType Prescaler);

#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

#if (ADC_CTU_CONTROL_MODE_EXTRA_APIS == STD_ON)
/**
* @brief   Function to set the trigger handler control registers of the CTU IPL.
*
* @details Full configurability of CTU THCR1 & THCR2 registers of the CTU IPL.
*          This function has in input the CTU trigger (0...7) and the mask (8 bit)
*          to enable the External Trigger and Timer output for that Trigger, without considering
*          the ADC command output enable.
*          See from the RM the THCR1 and THCR2 registers for the right Thcr_value to use.
*
* @note    The function Service ID[hex]: 0x35.
*
* @param[in]  Trigger     Index of the trigger: 0...7.
* @param[in]  ThcrValue   THCRx mask value (only with bits for Ext. Trigger and Timer) for the selected input trigger.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
*                 E_OK            In case of successful settings.
*                 E_NOT_OK        In case of unsuccessful settings.
*
* @implements  Adc_CtuWriteTriggerEnableMask_Activity
*/
Std_ReturnType Adc_CtuWriteTriggerEnableMask(Adc_CtuTrigSrcType Trigger,
                                             uint8 ThcrValue);

/**
* @brief   Function to set or clear the bit Tx_E of the trigger handler control registers of the CTU IPL.
*
* @details Full configurability of CTU THCR1 & THCR2 registers of the CTU IPL.
*          This function has in input the CTU trigger (0...7) and a Boolean to set to clear the right trigger bit.
*          See from the RM the THCR1 and THCR2 registers for the right API use.
*
* @param[in]  Trigger    Index of the trigger: 0...7.
* @param[in]  Enable     if True, the bit Tx_E shall be set to 1, 0 otherwise
*
* @note    The function Service ID[hex]: 0x36.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
*                 E_OK            In case of successful settings.
*                 E_NOT_OK        In case of unsuccessful settings.
*
* @implements  Adc_CtuSetTriggerEnable_Activity
*/
Std_ReturnType Adc_CtuSetTriggerEnable(Adc_CtuTrigSrcType Trigger,
                                       boolean Enable);

/**
* @brief   Function to set the cmd list handler control registers of the CTU IPL.
*
* @details Full configurability of CLCR1 & CLCR2 registers of the CTU IPL.
*          This function has in input the CTU trigger (0...7) and  the position of the first
*          command in the command list.
*          See from the RM the CLCR1 and CLCR2 registers for the right API use.
*
* @param[in]  Trigger      Index of the trigger: 0...7.
* @param[in]  ClcrValue    Position of the first command
*
* @note    The function Service ID[hex]: 0x37.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
*                 E_OK            In case of successful settings.
*                 E_NOT_OK        In case of unsuccessful settings.
*
* @implements  Adc_CtuSetTriggerAdcCmdAddress_Activity
*/
Std_ReturnType Adc_CtuSetTriggerAdcCmdAddress(Adc_CtuTrigSrcType Trigger,
                                              uint8 ClcrValue);

/**
* @brief   Function to set the trigger compare registers of the CTU IPL.
*
* @details Full configurability of CTU TxCR registers of the CTU IPL.
*          This function has in input the CTU trigger (0...7) and the comparator value
*          See from the RM the TxCR trigger compare registers for the right compare_value to use.
*
* @note    The function Service ID[hex]: 0x38.
*
* @param[in]  Trigger       Index of the trigger: 0...7.
* @param[in]  CompareValue  value to set in the register TxCR.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
*                 E_OK            In case of successful settings.
*                 E_NOT_OK        In case of unsuccessful settings.
*
* @implements  Adc_CtuSetTriggerCompare_Activity
*/
Std_ReturnType Adc_CtuSetTriggerCompare(Adc_CtuTrigSrcType Trigger,
                                        uint16 CompareValue);

#endif /* (ADC_CTU_CONTROL_MODE_EXTRA_APIS == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief   Function to dynamic handling of ADC channels list for Adc channel group.
*
* @details Dynamic handling of ADC channels list.
*          This function to dynamic handling of ADC channels list for Adc channel group.
* @param[in]  Group                     Group Id.
* @param[in]  Channel                   Pointer to array of channels to be reconfigured for the group. Channel value is logical channel ID.
* @param[in]  Delays                    Pointer to array of delay value associated with array of channels to be reconfigured.
* @param[in]  ChannelUpdateMask         Bitmask selecting which channels to be reconfigured.
* @param[in]  NumberOfChannel           Number of channels in channels array.
*
* @note    For platforms supporting delays (Only if ADC_IPW_DELAY_AVAILABLE == STD_ON):
*          Delays:
*           - If NULL_PTR: channel delay values are not reconfigured.
*           - If group has configured only 1 delay: pointer to new delay value.
*           - If group has configured delay for each channel: array with new delay values - number of elements must be NumberOfChannel.

*          ChannelUpdateMask:
*           - Bitmask example: 0b0110 only reconfigures channels from positions 1 and 2.
*           - This bit mask can be used only if number of group channels are not greater than number of SC1 registers
*           - Last bit of this mask must be set for having interrupt if NumberOfChannel is different than number of configured channels.
*
* @implements  Adc_SetChannel_Activity
*/
void Adc_SetChannel(Adc_GroupType Group,
                    const Adc_GroupDefType * Channel,
#if (ADC_IPW_DELAY_AVAILABLE == STD_ON)
                    const uint16 * Delays,
                    uint32 ChannelUpdateMask,
#endif /* (ADC_IPW_DELAY_AVAILABLE == STD_ON) */
                    Adc_ChannelIndexType NumberOfChannel);

#endif /* ADC_SETCHANNEL_API == STD_ON */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON)
/**
* @brief          Enters the already prepared power state.
* @details        This API configures the Adc module so that it enters the already prepared power
*                 state, chosen between a predefined set of configured ones.
*
* @param[out]     Result        Pointer to a variable to store the result of this function
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Power Mode changed.
*                 E_NOT_OK:       Request rejected.
*
* @implements  Adc_SetPowerState_Activity
*/
Std_ReturnType Adc_SetPowerState(Adc_PowerStateRequestResultType * Result);

/**
* @brief          Get the current power state of the ADC HW unit.
* @details        This API returns the current power state of the ADC HW unit.
*
* @param[out]     CurrentPowerState     The current power mode of the ADC HW Unit is returned in this parameter
* @param[out]     Result                Pointer to a variable to store the result of this function
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Mode could be read.
*                 E_NOT_OK:       Service is rejected.
*
* @implements  Adc_GetCurrentPowerState_Activity
*/
Std_ReturnType Adc_GetCurrentPowerState(Adc_PowerStateType * CurrentPowerState,
                                        Adc_PowerStateRequestResultType * Result);

/**
* @brief          Get the target power state of the ADC HW unit.
* @details        This API returns the target power state of the ADC HW unit.
*
* @param[out]     TargetPowerState      The Target power mode of the ADC HW Unit is returned in this parameter.
* @param[out]     Result                Pointer to a variable to store the result of this function.
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Mode could be read.
*                 E_NOT_OK:       Service is rejected.
*
* @implements  Adc_GetTargetPowerState_Activity
*/
Std_ReturnType Adc_GetTargetPowerState(Adc_PowerStateType * TargetPowerState,
                                       Adc_PowerStateRequestResultType * Result);

/**
* @brief          Starts the needed process to allow the ADC HW module to enter the requested power state.
* @details        This API starts the needed process to allow the ADC HW module to enter the requested power state.
*
* @param[in]      PowerState      The target power state intended to be attained.
* @param[out]     Result          Pointer to a variable to store the result of this function.
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           Mode could be read.
*                 E_NOT_OK:       Service is rejected.
*
* @implements  Adc_PreparePowerState_Activity
*/
Std_ReturnType Adc_PreparePowerState(Adc_PowerStateType PowerState,
                                     Adc_PowerStateRequestResultType * Result);

