Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#if (ADC_POWER_STATE_ASYNCH_MODE_SUPPORTED == STD_ON)
/**
* @brief          Cyclically called and supervises the power state transitions.
* @details        This API is cyclically called and supervises the power state transitions, checking for the readiness of the module and issuing the callbacks.
*
* @param[in]      none
* @param[out]     none
*
* @return         void
*/
void Adc_Main_PowerTransitionManager(void);
#endif /* (ADC_POWER_STATE_ASYNCH_MODE_SUPPORTED == STD_ON) */
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/**
* @brief   Function to enable CTU control mode for an ADC unit.
*
* @details Enable CTU control mode for an ADC unit.
*          This function to enable CTU control mode for Adc. When a unit works in CTU control mode,
*          no other conversions shall run in parallel(Adc). The only conversions occurring shall be
*          the ones defined in the CTU configuration.
*
* @param[in]  Unit      Adc unit used. Recommended to use generated define for Adc Logical Unit Id (e.g: AdcHwUnit_0)
*
* @return         void
*
* @implements  Adc_EnableCtuControlMode_Activity
*/
void Adc_EnableCtuControlMode(Adc_HwUnitType Unit);

/**
* @brief   Function to disable CTU control mode for an ADC unit.
*
* @details Disable CTU control mode for an ADC unit.
*          This function to disable CTU control mode for Adc. The other Adc conversions can run in
*          software trigger normal mode, software trigger injected mode or hardware trigger mode.
*
* @param[in]  Unit      Adc unit used. Recommended to use generated define for Adc Logical Unit Id (e.g: AdcHwUnit_0)
*
* @return         void
*
* @implements  Adc_DisableCtuControlMode_Activity
*/
void Adc_DisableCtuControlMode(Adc_HwUnitType Unit);

/**
* @brief   Function to enable CTU hardware trigger.
*
* @details Enable CTU hardware trigger.
*
* @param[in]  TrigSource      Symbolic name of source trigger index (e.g CtuHwUnit_0_CtuTriggerCfg_0; BctuHwUnit_0_BctuInternalTrigger_0)
*                             Symbolic name format:
*                              - Bit fields [15-8]: The CTU Logical Unit Id
*                              - Bit fields [7-0]: Trigger Control index in CTU unit.
*
* @return         void
*
* @implements  Adc_CtuEnableHwTrigger_Activity
*/
void Adc_CtuEnableHwTrigger(Adc_CtuTrigSrcType TrigSource);

/**
* @brief   Function to disable CTU hardware trigger.
*
* @details Disable CTU hardware trigger.
*
* @param[in]  TrigSource      Symbolic name of source trigger index (e.g CtuHwUnit_0_CtuTriggerCfg_0; BctuHwUnit_0_BctuInternalTrigger_0)
*                             Symbolic name format:
*                              - Bit fields [15-8]: The CTU Logical Unit Id
*                              - Bit fields [7-0]: Trigger Control index in CTU unit.
*
* @return         void
*
* @implements  Adc_CtuDisableHwTrigger_Activity
*/
void Adc_CtuDisableHwTrigger(Adc_CtuTrigSrcType TrigSource);

/**
* @brief   Function to start CTU conversion.
*
* @details Start CTU conversion.
*
* @param[in]  TrigSource      Symbolic name of source trigger index (e.g CtuHwUnit_0_CtuTriggerCfg_0; BctuHwUnit_0_BctuInternalTrigger_0)
*                             Symbolic name format:
*                              - Bit fields [15-8]: The CTU Logical Unit Id
*                              - Bit fields [7-0]: Trigger Control index in CTU unit.
*
* @return         void
*
* @implements  Adc_CtuStartConversion_Activity
*/
void Adc_CtuStartConversion(Adc_CtuTrigSrcType TrigSource);

#if (ADC_IPW_CTU_AVAILABLE == STD_ON)
/**
* @brief   Issue a software master reload signal for CTU.
*
* @details Issue a software master reload signal for CTU in CTU Control Mode.
*
* @param[in]    CtuUnit     CTU hardware unit. Recommended to use generated define for Ctu Logical Unit Id (e.g: CtuHwUnit_0)
*
* @return       void
*
* @implements  Adc_CtuMasterReload_Activity
*/
void Adc_CtuMasterReload(Adc_HwUnitType CtuUnit);

#endif /* (ADC_IPW_CTU_AVAILABLE == STD_ON) */

#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
/**
* @brief   Function to read BCTU conversion data.
*
* @details Read CTU conversion data.
*
* @param[in]    AdcUnit             Adc HW unit. Recommended to use generated define for Adc Logical Unit Id.
*
* @return       Adc_ValueGroupType  Conversion result.
*
* @implements  Adc_CtuReadConvData_Activity
*/
Adc_ValueGroupType Adc_CtuReadConvData(Adc_HwUnitType AdcUnit);

/**
* @brief   Function to read BCTU conversion result.
*
* @details Read BCTU conversion result.
*
* @param[in]    AdcUnit      Adc HW unit. Recommended to use generated define for Adc Logical Unit Id.
* @param[out]   pResult      Adc result structure.
*
* @return       void
*
* @implements  Adc_CtuReadConvResult_Activity
*/
void Adc_CtuReadConvResult(Adc_HwUnitType AdcUnit,
                           Adc_CtuResultType * pResult);

/**
* @brief   Function to stop CTU loop conversion.
*
* @details Stop CTU loop conversions.
*
* @param[in]  TrigSource      Symbolic name of source trigger index (e.g CtuHwUnit_0_CtuTriggerCfg_0; BctuHwUnit_0_BctuInternalTrigger_0)
*                             Symbolic name format:
*                              - Bit fields [15-8]: The CTU Logical Unit Id
*                              - Bit fields [7-0]: Trigger Control index in CTU unit.
*
* @return         void
*
* @implements  Adc_CtuStopLoopConversions_Activity
*/
void Adc_CtuStopLoopConversions(Adc_CtuTrigSrcType TrigSource);

#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

/**
* @brief   Function to read CTU conversion data from FIFO.
*
* @details Read CTU conversion data from FIFO.
*
* @param[in]   FifoIdx      Symbolic name of CTU FIFO index (e.g: CtuHwUnit_0_CtuResultFifos_0; BctuHwUnit_0_BctuResultFifos_0)
*                           Symbolic name format:
*                            - Bit fields [15-8]: The CTU Logical Unit Id
*                            - Bit fields [7-0]: FIFO index in CTU unit.
* @param[out]  Data         Pointer to pre-allocated result array.
* @param[in]   DataLength   Max amount of results to be read.
*
* @return         void
*
* @implements  Adc_CtuReadFifoData_Activity
*/
void Adc_CtuReadFifoData(Adc_CtuFifoIdxType FifoIdx,
                         uint16 * Data,
                         uint8 DataLength);

/**
* @brief   Function to read CTU conversion results from FIFO.
*
* @details Read CTU conversion results from FIFO.
*
* @param[in]   FifoIdx      Symbolic name of CTU FIFO index (e.g: CtuHwUnit_0_CtuResultFifos_0; BctuHwUnit_0_BctuResultFifos_0)
*                           Symbolic name format:
*                            - Bit fields [15-8]: The CTU Logical Unit Id
*                            - Bit fields [7-0]: FIFO index in CTU unit.
* @param[out]  Result           Pointer to pre-allocated result array.
* @param[in]   ResultLength     Max amount of results to be read.
*
* @return         void
*
* @implements  Adc_CtuReadFifoResult_Activity
*/
void Adc_CtuReadFifoResult(Adc_CtuFifoIdxType FifoIdx,
                           Adc_CtuFifoResultType * Result,
                           uint8 ResultLength);

/**
* @brief   Function to set CTU FIFO watermark.
*
* @details Set CTU FIFO watermark.
*
* @param[in]   FifoIdx      Symbolic name of CTU FIFO index (e.g: CtuHwUnit_0_CtuResultFifos_0; BctuHwUnit_0_BctuResultFifos_0)
*                           Symbolic name format:
*                            - Bit fields [15-8]: The CTU Logical Unit Id
*                            - Bit fields [7-0]: FIFO index in CTU unit.
* @param[in]   Watermark    Watermark value.
*
* @return         void
*
* @implements  Adc_CtuSetFifoWatermark_Activity
*/
void Adc_CtuSetFifoWatermark(Adc_CtuFifoIdxType FifoIdx,
                             uint8 Watermark);

/**
* @brief   Function to enable CTU notification.
*
* @details Enable CTU notification.
*
* @param[in] Notification  Notification to be enabled.
* Note: CTU logical mask must be 'OR'ed together with other notification masks (e.g: ADC_IPW_CTU_NOTIF_CTU_LOGICAL_0 | ADC_IPW_CTU_NOTIF_FIFO0_OVERFLOW)
*
* @return         void
*
* @implements  Adc_CtuEnableNotification_Activity
*/
void Adc_CtuEnableNotification(Adc_CtuNotificationType Notification);

/**
* @brief   Function to disable CTU notification.
*
* @details Disable CTU notification.
*
* @param[in] Notification  Notification to be disabled.
* Note: CTU logical mask must be 'OR'ed together with other notification masks (e.g: ADC_IPW_CTU_NOTIF_CTU_LOGICAL_0 | ADC_IPW_CTU_NOTIF_FIFO0_OVERFLOW)
*
* @return         void
*
* @implements  Adc_CtuDisableNotification_Activity
*/
void Adc_CtuDisableNotification(Adc_CtuNotificationType Notification);

/**
* @brief   Function to set CTU list.
*
* @details Reconfigure the CTU list of conversions in CTU Control Mode.
*
* @param[in] CtuUnit           Symbolic names of CTU Hardware units. (CTU logical unit ID)
* @param[in] ListItemsArray    Pointer to list items array to be set.
* @param[in] NumItems          Number of items in the array.
* @param[in] ListStartPosition Start position of the list.
*
* @return         void
*
* @implements  Adc_CtuSetList_Activity
*/
void Adc_CtuSetList(Adc_HwUnitType CtuUnit,
                    const Adc_CtuListItemType * const ListItemsArray,
                    const uint8 NumItems,
                    const uint8 ListStartPosition);

/**
* @brief   Reconfigure the list pointer of a triggered CTU source.
*
* @details Reconfigure the list pointer of a trigger source in CTU Control Mode.
*
* @param[in]  TrigSource      Symbolic name of source trigger index (e.g CtuHwUnit_0_CtuTriggerCfg_0; BctuHwUnit_0_BctuInternalTrigger_0)
*                             Symbolic name format:
*                              - Bit fields [15-8]: The CTU Logical Unit Id
*                              - Bit fields [7-0]: Trigger Control index in CTU unit.
* @param[in] ListPtr           Position of the first channel of the command list.
*
* @return         void
*
* @implements  Adc_CtuSetListPointer_Activity
*/
void Adc_CtuSetListPointer(Adc_CtuTrigSrcType TrigSource,
                           Adc_CtuListPtrType ListPtr);

