Jonah-Zhang1/AS470_V300_S32K324_TEMPLATE_S32DS_CAN/S32K324_TEMPLATE_S32DS_M7_0/MCAL/Adc_TS_T40D34M30I0R0/include/Adc.h
#endif /* ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON */

#if (ADC_ENABLE_TEMPSENSE_API == STD_ON)
/**
* @brief   Function to calculate temperature on chip from provided data.
*
* @details Calculates temperature on chip from provided data.
*
* @param[in] Unit                 Adc unit used. Recommended to use generated define for Adc Logical Unit Id.
* @param[in] TempSenseConvData    Data measured on the ADC internal channel for TempSense.
* (1 bit for the sign, 11 bits for the integer part and 4 bits for the decimal part)
*
* @return         uint16          Temperature value on chip.in degrees C, expressed in fixed point format.
*
* @implements  Adc_TempSenseCalculateTemp_Activity
*/
uint16 Adc_TempSenseCalculateTemp(Adc_HwUnitType Unit,
                                  const uint16 TempSenseAdcConvData);

/**
* @brief   Function to get the temperature on chip directly.
*
* @details This function starts a normal software conversion with one-shot mode on tempsense
* channel and calculates the temperature on chip from the data conversion
* The function is synchronous: waits until the ADC conversion completes or timeout occurs
*
* @param[in]  Unit                Adc unit used. Recommended to use generated define for Adc Logical Unit Id.
* @param[out] TempSenseVal        Temperature value on chip in degrees C, expressed in fixed point format.
* (1 bit for the sign, 11 bits for the integer part and 4 bits for the decimal part)
*
* @return         Std_ReturnType  Standard return type.
*                 E_OK:           temperature read successful
*                 E_NOT_OK:       operation failed
* @implements  Adc_TempSenseGetTemp_Activity
*/
Std_ReturnType Adc_TempSenseGetTemp(Adc_HwUnitType Unit,
                                    uint16 * const TempSenseVal);

/**
* @brief          Set the Tempsense mode either to powerdown or normal.
* @details        Set the Tempsense mode either to powerdown or normal.
*
* @param[in]      SetPowerMode    Power mode to set: normal or powerdown.
*
* @return         Std_ReturnType  Successful/Unsuccessful transition.
*
* @implements  Adc_TempSenseSetPowerMode_Activity
*/
Std_ReturnType Adc_TempSenseSetPowerMode(Adc_SetPowerModeType SetPowerMode);

#endif /* (ADC_ENABLE_TEMPSENSE_API == STD_ON) */

#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */

#endif /* ADC_H */
